#+BEGIN_COMMENT
.. title: English To French Data
.. slug: english-to-french-data
.. date: 2020-10-13 17:04:25 UTC-07:00
.. tags: nlp,embeddings,data
.. category: NLP
.. link: 
.. description: Building the embeddings subset.
.. type: text

#+END_COMMENT
#+OPTIONS: ^:{}
#+TOC: headlines 2

#+PROPERTY: header-args :session ~/.local/share/jupyter/runtime/kernel-ae9a3fd3-75ec-4802-bd31-5fdfee92d2aa.json

#+BEGIN_SRC python :results none :exports none
%load_ext autoreload
%autoreload 2
#+END_SRC

#+begin_src python :tangle ../../neurotic/nlp/word_embeddings/embeddings.py :exports none
<<embeddings-notes>>

<<embeddings-imports>>


<<embeddings-loader>>

    <<embeddings-embeddings>>


<<embeddings-subset>>

    <<embeddings-subset-1>>

    <<embeddings-subset-2>>

    <<embeddings-subset-save>>

    <<embeddings-subset-call>>

    <<embeddings-subset-clean>>


<<embeddings-dictloader>>

    <<embeddings-dataframe>>

    <<embeddings-dictionary>>


<<embeddings-keys>>

<<source-keys>>


<<target-keys>>


<<keys>>


<<source-paths>>


<<target-paths>>


<<paths>>


<<load-and-build>>


<<embeddings-work-loader>>

    <<embeddings-work-paths>>

    <<embeddings-work-english>>

    <<embeddings-work-french>>

    <<embeddings-work-training>>

    <<embeddings-work-testing>>
#+end_src

*** Loading It
#+begin_src python :results output
from neurotic.nlp.word_embeddings.embeddings import Embeddings

english_embeddings = Embeddings(os.environ["GOOGLE_EMBEDDINGS"], binary=True)
french_embeddings = Embeddings(os.environ["FRENCH_EMBEDDINGS"], binary=False)
print(english_embeddings.embeddings)
#+end_src

#+RESULTS:
: <gensim.models.keyedvectors.Word2VecKeyedVectors object at 0x7f9091e90cd0>

#+begin_src python :results output :exports both
from neurotic.nlp.word_embeddings.embeddings import DictLoader

training = DictLoader(os.environ["ENGLISH_FRENCH_TRAINING"])
testing = DictLoader(os.environ["ENGLISH_FRENCH_TESTING"])

train_keys = set(training.dictionary)
test_keys = set(testing.dictionary)
print(train_keys.intersection(test_keys))
#+end_src

#+RESULTS:
: set()

After I made the subset builder it occured to me that if there was overlap between the testing and training sets but they mapped to different definitions then the way I was going to build them would require two separated dictionaries, but as you can see, the training and testing sets don't have English terms in common.

#+begin_src python :results output :exports both
merged = training.dictionary.copy()
merged.update(testing.dictionary)
print(len(training.dictionary))
print(len(testing.dictionary))
print(len(merged))
#+end_src

#+RESULTS:
: 5000
: 1500
: 6500

#+begin_src python :results none
from neurotic.nlp.word_embeddings.embeddings import SubsetBuilder

english_path = Path(os.environ["ENGLISH_EMBEDDINGS_SUBSET"])
french_path = Path(os.environ["FRENCH_EMBEDDINGS_SUBSET"])

builder = SubsetBuilder(embeddings_1=english_embeddings.embeddings,
                        embeddings_2=french_embeddings.embeddings,
                        subset_dict=merged,
                        output_1=english_path, output_2=french_path)
builder()
#+end_src

#+begin_src python :results none
builder = SubsetBuilder(embeddings_1=None,
                        embeddings_2=None,
                        subset_dict=None,
                        output_1=english_path, output_2=french_path)
#+end_src
